#include <iostream>
using namespace std;

// A说：洞庭湖最大，洪泽湖最小，鄱阳湖第三。

// B说：洪泽湖最大，洞庭湖最小，鄱阳湖第二，太湖第三。

// C说：洪泽湖最小，洞庭湖第三。

// D说：鄱阳湖最大，太湖最小，洪泽湖第二，洞庭湖第三


int main(){
    int a, b, c, d; // a 鄱阳湖, b 洞庭湖，c 太湖， d 洪泽湖
    for(a = 1; a <= 4; a ++){
        for(b = 1; b <= 4; b++){
            for(c = 1; c <= 4; c++){
                for(d = 1; d <= 4; d++){
                    if( (a != b && a != c && a != d && b != c && b != d && c != d) 
                    && ( (b == 1) + (d == 4) + (a == 3) == 1 )
                    && ( (d == 1) + (b == 4) + (a == 2) + (c == 3) == 1 )
                    && ( (d == 4) + (b == 3) == 1)
                    && ( (a == 1) + (c == 4) + (d == 2) + (b == 3) == 1 ) ){
                        cout << a << endl << b << endl << c << endl << d << endl;
                    }
                }
            }
        }
    }
    return 0;
}
